## Plan Result (ptlsbox-jenkins)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.hmctsacrpull
  * azurerm_role_assignment.miroles
  * azurerm_role_assignment.subidcontributer[&#34;sbox&#34;]
  * azurerm_role_assignment.subiduseraccessadmin[&#34;sbox&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.hmctsacrpull will be created
  + resource "azurerm_role_assignment" "hmctsacrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0292f26e-288e-4f5b-85fc-b99a53f0a2b1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.miroles will be created
  + resource "azurerm_role_assignment" "miroles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0292f26e-288e-4f5b-85fc-b99a53f0a2b1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.subidcontributer["sbox"] will be created
  + resource "azurerm_role_assignment" "subidcontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0292f26e-288e-4f5b-85fc-b99a53f0a2b1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.subiduseraccessadmin["sbox"] will be created
  + resource "azurerm_role_assignment" "subiduseraccessadmin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0292f26e-288e-4f5b-85fc-b99a53f0a2b1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":20,"Program":"tfcmt","SHA1":"","Target":"ptlsbox-jenkins","Vars":{}} -->